Documents/ESB/ESB_Consumer_1006/003TestSample/SAMPLE_XML_MUST/RewardPoints/RP05_RwdPntsHistInqRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/RewardPoints/RwdPntsHistInqRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>RewardPoints</ServiceDomain>  
      <OperationName>RwdPntsHistInq</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:RwdPntsHistInqRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>RP05</v11:TxnId>  
        <v11:TxnNo>RP050001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:NoOfPage>10</v11:NoOfPage>  
        <!--Optional:-->  
        <v11:PageNo>1</v11:PageNo>  
        <v11:MmbId>999123456789</v11:MmbId>  
        <v11:StartDate>20190608</v11:StartDate>  
        <v11:EndDate>20190609</v11:EndDate> 
      </v11:ServiceBody> 
    </v11:RwdPntsHistInqRq> 
  </soap:Body> 
</soap:Envelope>
